Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་ན་མེ་ཏོག་དང་ལྡན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གང་དུ་བཅོམ་ལྡན་འདས་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པ་དབང་པོའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་དེ་ཆོས་སྟོན་ཏེ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ།
en: There is a world sphere there called Kusumāvatī where the tathāgata Lord Saṃkusumita Rājendra dwells. An arhat, one perfectly awakened, perfected in wisdom and conduct, the bliss-gone one, the supreme knower of the world, the guide of people who need to be tamed, the preceptor of gods and men , he expounds the Dharma that is good in the beginning, good in the middle, and good in the end.

source: དོན་བཟང་པོ་ཚིག་འབྲུ་བཟང་པོ། །མ་འདྲེས་པ་ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་དཀར་བ་ཚངས་པར་སྤྱོད་པ་ཡང་དག་པར་སྟོན་ཏོ། །
en: He presented an account of the buddha activity that is profoundly meaningful, full of beautiful figures of speech, original, complete, perfectly pure, and highly polished.

source: དེ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །སྔགས་ཀྱི་སྤྱོད་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་དང་། ལམ་གསུམ་གྱི་སྤྱོད་པའི་ལམ་སྒྲུབ་པར་བྱེད་པ། སྐྱོབ་པ་དང་གནས་དང་སྐྱབས་དང་དཔུང་གཉེན་དང་། བདེ་བ་དང་ཤིན་ཏུ་མཐར་ཐུག་པ་དང་ཤིན་ཏུ་ཡོངས་སུ་མཐར་ཕྱིན་པར་བྱེད་པ་སེམས་ཅན་རྣམས་ལ་སྟོན་ཏེ
en: He is presently living and teaching all sentient beings the Dharma, the bodhisattva basket that pertains to the mantra practice, the path that conforms to the practice of the threefold path, the protection, the place of rest, the refuge, the highest aim, the well-being, and the ultimate and final cessation.

source: བཅོམ་ལྡན་འདས་དེ་ཉིད་ཀྱིས་རྗེས་སུ་གནང་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་དྲུང་འདིར་མཆིས་སོ། །
en: It is by his command that I have arrived here in your presence, to be at your feet.

source: བཅོམ་ལྡན་འདས་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་ཡང་། བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་འདྲིའོ། །
en: Lord Saṃkusumita Rājendra, the tathāgata, asks if you are without pain and without worry, if your efforts come easily to you, and if your life is comfortable.

source: འདི་སྐད་ཀྱང་གསུང་སྟེ
en: He also said this: {1.30}

source: གང་དུ་འདི་ལྟ་བུའི་སྙིགས་མ་ལྔའི་དུས་སུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འབྱུང་བ་ནི་ངོ་མཚར་ཏོ་ཞེས་སོ། །
en: “ ‘It is indeed wonderful that in this time of the five degenerations Lord Śākyamuni, the awakened one, has appeared

source: དེ་ཡང་ལམ་གསུམ་དང་བྱང་གྲོལ་དང་མིར་སྐྱེ་བ་ཐོབ་པ་ཉིད་ཀྱི་ཆོས་སྟོན་པར་བྱེད་དོ། །
en: —the Dharma that consists of the threefold path and that brings about rebirth as a god or a human and final emancipation.

source: གང་དུའང་སེམས་ཅན་གྱི་རིས་སྐལ་བ་མེད་པ་དང་། སྲིད་པ་གསུམ་ཡང་དག་འཇོམས་པར་བྱེད་པའི་ལམ་དང་གཏན་ཏུ་གྲུབ་པ་དང་བདེ་བ་དང་། མཐུན་པའི་མྱ་ངན་ལས་འདས་པ་ལ་སེམས་ཅན་རྣམས་དགོད་པར་བྱེད་པའི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་བརྩོན་འགྲུས་ནི་ངོ་མཚར་ཏོ། །
en: Wonderful indeed is Lord Śākyamuni’s courage, that in this world of helpless beings he establishes them on the path that leads to escape from the three realms, and he also establishes them in the state of nirvāṇa, which is complete with boundless spiritual accomplishment and happiness.

source: བཅོམ་ལྡན་འདས་བསམ་གྱིས་མི་ཁྱབ་བོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཐུགས་ནི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་པར་འགྱུར་གྱི།
en: Is it not true that only the awakened ones can know the minds of the lord buddhas?

source: བདག་གིས་ཅི་ཞིག་འཚལ་བ་རྔོ་ཐོགས། དབང་ཕྱུག་གིས་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ། རྨད་དུ་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཤེས་པར་རམ། འཚལ་བར་རམ། ཐུགས་ཀྱི་སྤྱད་པ་སྤྱོད་པའི་རྗེས་སུ་འཇུག་པའི་སྒྲུབ་པ་དང་། སྤྱོད་པ་འཚལ་བར་རམ་མདོར་ན་བསྐལ་པ་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་གི་བར་དུའང་བསྟན་པར་མི་ནུས་སོ། །
en: How could I know how to perform the magical feats of the lord buddhas, whose miracles stem from an inconceivable, wondrous, superhuman power? How could I know of their engagement in the mental and physical conduct that constitutes their potential for the accomplishment of tasks? Would I be able to even summarize these things in hundreds of thousands of millions of eons?

source: གང་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་བསྡུས་པའམ། ཐ་དད་མ་ལུས་པའི་ངོ་བོ་འདི་ནི་ཆོས་འདུས་མ་བྱས་སུ་བལྟ་བར་བྱ་སྟེ།
en: The accomplishments of the tathāgatas, and all their forms without exception, whether separate and distinct or altogether, should be seen in terms of unconditioned dharmas.

source: མཐོང་བས་སྤང་བར་བྱ་བ་ལ་བརྟེན་པའམ། ཡོན་ཏན་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཁོ་ནས་མཁྱེན་པ་ཡིན་གྱི་བདག་གིས་ནི་མ་ལགས་སོ། །
en: Only you, O Lord, the tathāgata, can explain the conduct and the qualities related to the elimination of traits eliminable through the path of seeing. I cannot do that.’ ” {1.31}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་རང་གི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པས་རིན་པོ་ཆེའི་པདྨ་སྤྲུལ་པ་ལ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་བལྟ་ཞིང་འདུག་གོ། །
en: Seated on a great jeweled lotus miraculously created through his own magical power, Mañjuśrī, the divine youth, watched Lord Śākyamuni with anticipation.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་དེ་བཞིན་གཤེགས་པ་དང་རྗེས་སུ་མཐུན་པའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་སྔོན་དུ་འགྲོ་བ་མཛད་ནས་ཆོས་བསྟན་པ་དང་རྗེས་སུ་མཐུན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྒྲུབ་པ་དང་རྗེས་སུ་མཐུན་པས་ཚངས་པའི་དབྱངས་དང་། ཀ་ལ་པིང་ཀའི་སྐད་དང་འབྲུག་སྒྲ་དང་། རྔ་བོ་ཆེའི་སྒྲ་སྐད་ཀྱི་གསུང་གི་དབྱངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: The latter, following the usual practice of a tathāgata, first gave by way of introduction the customary manifold preamble preceded by questions from the audience, and then he spoke to Mañjuśrī, the divine youth, the bodhisattva, the great being, with a voice as sweet as Brahmā’s, a voice that resembled the call of a cuckoo or the resounding of thunder or a drum, a voice that is fitting to a Dharma discourse and causes the bodhisattva to be accomplished: {1.32}

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཁྱོད་ལེགས་པར་འོངས་སམ། །
en: “Welcome to you, Mañjuśrī!

source: སེམས་དཔའ་ཆེན་པོའི་སྤྱོད་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་བསྒྲུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དོན་ཐོབ་པར་བྱེད་པ།
en: It is the manual that effects the accomplishment of the conduct of great beings; that is blessed by the buddhas; that achieves the aims of bodhisattvas;

source: སྔགས་ཐམས་ཅད་ཀྱི་ཚིག་དང་གསང་བ་དང་བཅས་པ་དང་། དབང་བསྐུར་བ་དང་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་ཆོ་ག་དང་། དབང་བསྐུར་བ་དང་ཚེ་དང་ནད་མེད་པ་དང་། དབང་ཕྱུག་དང་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: that contains the mantra topics together with the secret empowerments, mudrās, maṇḍalas, and empowerment rituals; that brings about long life, lack of illness, and dominion and fulfills all wishes;

source: སྒྲུབ་པའི་ཐབས་ཐམས་ཅད་དང་ལྡན་པ་རྒྱུད་ཤེས་པ་དང་། ཤེས་བྱ་དང་དུས་དང་མི་སྣང་བ་དང་། རྒྱལ་པོའི་ཞིང་དུ་གྱུར་པ་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་ཤེས་པར་བྱེད་པ་མདོར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: that contains all the tantras on sādhana rites; that causes one to know all minds and mental objects, the occurrences in all times, all hidden phenomena, and the kingdoms and realms in the past, present, and future—in short, the fulfillment of all the wishes of all beings.

source: རང་གི་ཡོན་ཏན་དང་མཐུན་པའི་སྔགས་ཀྱི་སྤྱོད་པ་རྗེས་སུ་འཇུག་པ། སེམས་ཅན་གཞན་དགའ་བར་བྱེད་པ་མི་སྣང་བར་འགྲོ་བ།
en: This is a mantra practice that facilitates the generation of good qualities and is the cause of the joy of beings. This manual contains instructions on becoming invisible;

source: ནམ་མཁའ་ལ་འགྲོ་བ།
en: traveling through space;

source: ཆུ་ལ་མི་ནུབ་པར་འགྲོ་བ།
en: fast walking;

source: ཡིད་གཞུངས་པར་བྱེད་པ།
en: increasing intelligence;

source: འགུགས་པར་བྱེད་པ།
en: the magic of summoning;

source: ས་འོག་ཏུ་འཇུག་པ།
en: the ability to visit subterranean paradises;

source: མངོན་དུ་སྤྱོད་པར་བྱེད་པ།
en: the rites of assault;

source: འདོད་པ་ཐམས་ཅད་ཐོབ་པར་བྱེད་པ།
en: the obtainment of every sensual pleasure;

source: གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་མོ་ཐམས་ཅད་དང་། མངག་གཞུག་པ་དང་ཤ་ཟ་དང་འབྱུང་པོ་ཐམས་ཅད་འགུགས་པར་བྱེད་པ།
en: the power to summon the multitudes of yakṣa s and yakṣiṇīs, kiṃkaras, piśācas, and bhūtas;

source: བྱིས་པ་དང་། རྒན་པོ་དང་གཞོན་ནུ་གནས་ཅི་ལྟ་བ་བཞིན་འཇོག་པར་བྱེད་པ།
en: and the power to become a child, an old person, or a youth, as required by circumstances. {1.33}

source: མདོར་ན་ལས་ཐམས་ཅད་བྱེད་པ་སྟེ།
en: “In short, this teaching has the power to perform all actions;

source: ཡིད་ལ་རེ་བ་ཐམས་ཅད་རྫོགས་པར་བྱེད་པ། མངོན་སྤྱོད་དང་རྒྱས་པ་དང་། ཞི་བའི་ལས་དག་རབ་ཏུ་བྱེད་པ་ཇི་ལྟ་ཇི་ལྟར་རབ་ཏུ་སྦྱར་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ།
en: it fulfills the heart’s every wish, magically manifesting itself in the magic of assault, of enriching, and of pacifying. It will be accomplished exactly according to how it is applied.

source: བསྐལ་པ་ཆེན་པོའི་རིན་པོ་ཆེའི་ལེའུ་རབ་འབྱམ་འདི་ངས་ཀྱང་རྗེས་སུ་གནང་ཞིང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་གསུངས་ཏེ། སེམས་ཅན་དག་པའི་རང་གི་སྔགས་སྤྱོད་པའི་དོན་གྱི་ཆོས་ཀྱི་མཛོད།
en: Please teach now this ornament of the bodhisattva basket, this great, jewel-like, extensive manual, this treasury of teachings on the mantra practice of pure beings that was sanctioned by me and taught by all the buddhas.

source: སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། ལྷ་དང་མི་རྣམས་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བསྟན་པའི་ཕྱིར་རོ། །
en: Teach it for the benefit and happiness of many beings, gods and humans, with all sentient beings in mind.” {1.34}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་འོད་ཀྱི་སྣང་བ་བཀོད་པའི་རྒྱན་ཡང་དག་པར་བསྐུལ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དག་པའི་སེམས་ཅན་གྱི་འོད་ཀྱི་སྣང་བས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་མའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་། འོག་མིན་གྱི་གནས་ཀྱི་བར་དང་། མནར་མེད་པའི་དམྱལ་བ་ཆེན་པོའི་བར་དུ་ཁྱབ་པར་བྱས་ཏེ
en: Upon hearing this, Mañjuśrī, the divine youth, entered the bodhisattva samādhi called arousing with an array of light rays the blessing power of all the buddhas. As soon as he, the pure being, entered this samādhi, the light primarily illuminated the world spheres that were as numerous as the grains of sand in many Gaṅgā rivers, as well as all the buddhafields from the Akaniṣṭha heaven to the Avīci hell.

source: སེམས་ཅན་གང་སུ་དག་ཤིན་ཏུ་སྡུག་བསྔལ་བ་དེ་དག་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། །
en: Any beings that were experiencing pain attained a peaceful state with their suffering pacified.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡང་དག་པར་བསྐུལ་ནས། འོད་དེ་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སྤྱི་བོའི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ཏོ། །
en: Having aroused all the śrāvakas, pratyeka­buddhas, bodhisattvas, and lord buddhas, the light again disappeared into the bodhisattva Mañjuśrī’s forehead.

source: འདིར་གང་དག་ཤར་ཕྱོགས་ན་རྣམ་པར་གནས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་འོད་ཟེར་རླུང་གི་དཀྱིལ་འཁོར་གྱི་རེག་པའི་བྱ་བས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡང་དག་པར་བསྐུལ་ཏེ།
en: Immediately, all the lord buddhas who inhabited the buddhafields in the eastern direction were impelled by the display of the light sphere illuminating everything around.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་ཟླ་བ་དྲི་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་ལྷ་བཻ་ཌཱུརྱའི་འོད་དང་། དེ་བཞིན་གཤེགས་པ་དཔལ་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རྒྱལ་པོ་ཡང་དག་པར་འཕགས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གྱི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་ཏུ་མེད་པ་ཡེ་ཤེས་རྣམ་པར་ངེས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྣང་བའི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: These buddhas were: {1.35} The tathāgata Jyotis­saumya­gandhāvabhāsa­śrī, the tathāgata Bhaiṣajya­guru­vaiḍūrya­prabha­rāja, the tathāgata Samantāvabhāsa­śrī, the tathāgata Samudgata­rāja, the tathāgata Śālendra­rāja, the tathāgata Lokendra­rāja, the tathāgata Amitāyurjñāna­viniścaya­rāja, the tathāgata Anantāvabhāsa­rājendra, and the tathāgata Jyoti­raśmirājendra. {1.36}

source: དེ་དག་ལ་སོགས་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ། མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདུས་པ་དག་ལ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གནས་གཙང་མའི་ཁང་བཟངས་ནདེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྟོན་པ་དང་། སྔགས་ཀྱི་ཚིག་གི་དོན་གྱི་ལེའུ་རབ་འབྱམ་སྟོན་ཏེ
en: The lord buddhas headed by those just mentioned, surrounded by multitudes of bodhisattvas and residing in numberless and infinite world spheres—the tathāgatas, the arhats, the fully awakened ones—all congregated in the Sahā world in the realm of the Pure Abode where Śākyamuni, the tathāgata, the arhat, the fully awakened one, was staying together with Mañjuśrī, the divine youth, and expounding the vast topic of mantras and bodhisattva conduct. {1.37}

source: དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་བྱང་གི་ཕྱོགས་དང་ཕྱོགས་མཚམས་དང་སྟེང་དང་འོག་དང་ཐད་ཀ་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་སྣང་བར་བྱས་ཏེ།
en: So it was also in the southern, western, and northern directions, and in the intermediate directions.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་བདུད་ཀྱི་གནས་ཐམས་ཅད་སྤ་གོང་བར་བྱས་ནས་
en: The light illuminated there all the buddhafields that lie above, below, and across, and it obscured all the abodes of the māras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པས་མདུན་གྱིས་བལྟས་ཏེགནས་གཙང་མའི་གནས་སུ་སངས་རྒྱས་ཀྱི་འཕྲུལ་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་བདག་ཉིད་ཆེན་པོ་བལྟ་བར་འདོད་པ་དང་། སྔགས་ཀྱི་སྤྱོད་པ་བསྒྲུབ་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཁྱད་པར་དང་། ལེའུའི་ཚོགས་དང་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཐོགས་པ་མེད་པ། གསལ་བར་འདོད་པས་ཆས་པ་ནི་འདི་ལྟ་སྟེ།
en: All the tathāgatas who were surrounded by multitudes of bodhisattvas and accompanied by congregations of śrāvakas, desiring to see the Pure Abode, the miraculous power of the buddhas, and the greatness of bodhisattvas, and desiring to make the instructions of the tathāgatas—the vast topics of the different types of samādhi produced by the mantra practice—shine unimpeded throughout the world, took their places. They were: {1.38}

source: ལག་བཟང་དང་། རིན་ཆེན་བཟང་པོ་དང་། བརྟུལ་ཞུགས་བཟང་པོ་དང་། སྤྱན་མཛེས་དང་། བཟང་དགའ་དང་། ཆོས་བཟང་དང་། དོན་ཐམས་ཅད་གྲུབ་པ་དང་། ཐམས་ཅད་དུ་འཕགས་པ་དང་། ཆོས་འཕགས་དང་། རིན་ཆེན་འཕགས་དང་། རིན་ཆེན་དཔལ་དང་། ལྷུན་པོའི་དཔལ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དཔལ་དང་། འོད་བྱེད་དཔལ་དང་། འོད་དཔལ་དང་། དོན་ཐམས་ཅད་ཀྱི་དཔལ་དང་། ཐམས་ཅད་ཕྱག་ན་རིན་པོ་ཆེ་དང་། ཕྱག་ན་གཙུག་གི་རིན་པོ་ཆེ་དང་། ཕྱག་ན་ལྷུན་པོའི་རྒྱལ་མཚན་དང་། རྣམ་པར་སྣང་མཛད་སྙིང་པོ་དང་། རིན་ཆེན་སྙིང་པོ་དང་། ཡེ་ཤེས་སྙིང་པོ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དོན་གྱི་སྙིང་པོ་དང་། ཆོས་འཕགས་ཀྱི་སྙིང་པོ་དང་། རྒྱལ་མཚན་གྱི་ཏོག་དང་། ཏོག་བཟང་དང་། མཐའ་ཡས་ཏོག་དང་། དྲི་མ་མེད་པའི་ཏོག་དང་། མཐའ་དག་གི་ཏོག་དང་། ནམ་མཁའི་ཏོག་དང་། རིན་པོ་ཆེའི་ཏོག་དང་། འབྲུག་སྒྲ་དང་རྔ་བོ་ཆེའི་སྐད་ཀྱི་རྒྱལ་པོ་དང་། མཐའ་ཡས་པར་སྣང་བའི་ཡེ་ཤེས་ཀྱི་རྒྱལ་པོ་དང་། མུན་པ་མུན་ནག་ཐམས་ཅད་འཇོམས་པའི་རྒྱལ་པོ་དང་། གནོད་པ་ཐམས་ཅད་རྣམ་པར་འཇིག་པའི་རྒྱལ་པོ་དང་། སྤྱོད་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ཤེས་པའི་རྒྱལ་པོ་དང་། འཇིག་རྟེན་གྱི་དབང་པོའི་རྒྱལ་པོ་དང་། མངོན་པར་རྟོགས་པའི་དབང་པོའི་རྒྱལ་པོ་དང་། རྣམ་པར་འཇོམས་པར་བྱེད་པའི་རྒྱལ་པོ་དང་། ངེས་པར་གཡོ་བར་བྱེད་པའི་རྒྱལ་པོ་དང་། ཉི་མའི་རྒྱལ་པོ་དང་། དངོས་པོ་མེད་པ་ཡང་དག་པར་འཕགས་པའི་རྒྱལ་པོ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡང་དག་པར་འཕགས་པའི་རྒྱལ་པོ་དང་། མི་མཐུན་པའི་ཕྱོགས་མེད་པའི་རྒྱལ་པོ་དང་། རང་བཞིན་གྱི་འོད་དང་། བསོད་ནམས་འོད་དང་། འཇིག་རྟེན་འོད་དང་། དཔག་མེད་འོད་དང་། མཐའ་ཡས་འོད་དང་། སྤྱན་བཟང་འོད་དང་། འབྱུང་མེད་འོད་དང་། དོན་གྱི་འོད་དང་། མི་ཚུགས་པ་དང་། བཟོད་པར་དཀའ་བ་དང་། ལས་མེད་དང་། འོག་མིན་དང་། དྲི་མེད་དང་། མེ་དང་། འོད་དང་། བློ་དང་། རྟོགས་པ་དང་། བདེ་བ་དང་། བདེ་བའི་མུ་ཁྱུད་དང་། མུ་ཁྱུད་ཏོག་དང་། འདོད་པའི་ལྷ་དང་། ལྷ་དང་ལྷ་ཡུལ་ན་ཡོད་པ་དང་། ལྟེ་བ་དང་། རྒྱས་པ་དང་། འཇིག་རྟེན་ཞི་བ་དང་། ཉེ་བར་འདོད་པ་དང་། རྔ་བོ་ཆེ་དང་། གྲུབ་པ་དང་། དཀར་པོ་དང་། གྲགས་བཟང་དང་། བཟོད་པར་དཀའ་བ་དང་། རྙེད་པར་དཀའ་བ་དང་། གདུལ་བར་དཀའ་བ་དང་། བསྙེན་པར་དཀའ་བ་དང་། རིང་དུ་སོང་བ་དང་། རིང་བའི་དོན་དང་། རིང་བ་ལ་གནས་པ་དང་། མཐོ་བ་དང་། ཤིན་ཏུ་མཐོ་བ་དང་། སྲིན་བུ་མེ་ཁྱེར་དང་། ཀུན་ཏུ་སྣང་བ་དང་། སྣང་མེད་དང་། ཁྱུ་མཆོག་དང་། ཀུན་ནས་འོད་དང་། ཤིན་ཏུ་ཡིད་དུ་འོང་བ་དང་། ཡིད་བཟང་དང་། ལྷ་ཆེན་པོ་དང་། དྲི་མེད་བཟང་པོ་དང་། དྲི་མ་མཐར་བྱེད་དང་། དུལ་བ་དང་། ཞི་ལྡན་དང་། མཚན་བཟང་དང་། རྒྱལ་མཚན་དཀར་པོ་དང་། ཚད་ལྡན་དང་། ཅི་སྨྲ་དང་། ཐ་ཆུངས་དང་། སེལ་བྱེད་དང་། འཚོ་བ་དང་། ལེགས་སྐྱེས་དང་། དུ་བའི་ཏོག་དང་། རྒྱལ་མཚན་ཏོག་དང་། དཀར་བའི་ཏོག་དང་། ཏོག་བཟང་དང་། ནོར་ལྷའི་ཏོག་དང་། ནོར་ལྷའི་བུ་དང་། མེས་པོ་དང་། ཕ་དང་། མཐར་བྱེད་དང་། འཇིག་རྟེན་གྲགས་པ་དང་། ཀུན་ནས་གྲགས་པ་དང་། གྲགས་པ་ཆེན་པོ་དང་། དཔལ་ལྡན་དང་། ཕམ་བྱེད་དང་། འོད་བྱེད་དང་། མངག་གཞུག་པ་དང་། ཞི་བྱེད་དང་། འཇིག་རྟེན་བྱེད་དང་། ལྷ་བྱེད་དང་། མཐོ་རིས་བྱེད་དང་། མར་མེ་མཛད་དང་། འབྱུང་པོ་མཐར་བྱེད་དང་། དོན་ཐམས་ཅད་མཛད་དང་། གྲུབ་མཛད་དང་། གསལ་མཛད་དང་། སྣང་བར་མཛད་པ་དང་། རྔ་བོ་ཆེའི་སྒྲ་དང་། སྐད་ཀྱི་སྒྲ་དང་། སྒྲ་སྙན་དང་། མཐའ་ཡས་པའི་སྒྲ་དང་། ཏོག་གི་སྒྲ་དང་། ངན་སྤོང་གི་བུ་དང་། གསེར་ཐུབ་དང་། འཁོར་བ་འཇིག་དང་། འོད་སྲུང་དང་། གཙུག་ཏོར་ཅན་དང་། ཐམས་ཅད་སྐྱོ་བ་དང་། རྣམ་པར་གཟིགས་དང་། ཤཱཀྱ་ཐུབ་པ་དང་། འདི་དག་དང་། གཞན་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མང་པོ་དག་གིས་གནས་གཙང་མའི་གཞལ་མེད་ཁང་སྣང་བར་བྱས་ཏེ་
en: Subāhu , Suratna, Suvrata, Sunetra, Surata, Sudharma, Sarvārtha­siddhi, Sarvodgata, Dharmodgata, Ratnodgata, Ratnaśrī, Meruśrī, Acintyaśrī, Prabhākaraśrī, Prabhaśrī, Jyotiśrī, Sarvārthaśrī, Sarvaratnapāṇi, Cūḍāmaṇi, Merudhvajapāṇi, Vairocana­garbha, Ratnagarbha, Jñānagarbha, Sacintyārtha­garbha, Acintyārtha­garbha, Dharmodgata­garbha, Dhvajaketu, Suketu, Anantaketu, Raśmiketu, Vimalaketu , Aśeṣaketu, Gaganaketu, Ratnaketu , Garjita­ghoṣa­dundubhi­svara­rāja, Anantāvabhāsa­jñāna­rāja, Sarva­tamāndha­kāra­vidhamana­rāja, Sarva­vikiraṇa­bodhi­vidhvaṃsana­rāja, Sarva­caryātiśaya­jñāna­rāja, Lokendra­rāja, Atiśayendra­rāja, Vidhamanarāja, Nirdhūtarāja, Ādityarāja, Abhāva­samudgata­rāja, Svabhāva­samudgata­rāja, Abhāva­svabhāva­samudgata­rāja, Avipakṣitarāja, Svabhāvabha, Puṇyābha , Lokābha, Amitābha, Anantābha, Sunetrābha, Susambhavābha, Arthabhāvābha, Adhṛṣya, Amṛṣya, Akarma, Akaniṣṭha, Amala, Anala, Dyuti, Pati, Mati, Sukha, Sukhanemi, Nimiketu, Ṛkṣa, Divideva, Divya, Nābhi, Bharata , Lokaśānti, Umāriṣṭa, Dundubhi, Siddha , Sita, Ākhyadivya, Duḥprasaha, Durgharṣa, Durālabha, Dūraṅgama, Durāla, Dūrasthita, Ucca, Uccatama, Khadyota, Samantadyota, Adyota, Ṛṣabha, Ābha, Sumanāpa, Sumanas, Mahādeva, Sunirmala , Malānta, Dānta, Sami, Sūci, Cihna, Śvetadhvaja, Imi, Kimi, Kaniṣṭha, Nikarṣa, Jīva, Sujāta, Dhūmaketu, Dhvajaketu, Śvetaketu, Suketu, Vasuketu, Vasava, Pitāmaha, Pitā, Niṣkakuru, Lokākhya, Sahākhya, Mahākhya, Śreyās, Tejās, Jyotis, Kiṃkara , Samaṃkara, Lokaṃkara, Divaṃkara, Dīpaṃkara, Bhūtāntakara, Sarvārthaṃkara, Siddhaṃkara, Jyotiṃkara, Avabhāsaṃkara, Dundubhisvara, Rutasvara, Susvara , Anantasvara, Ketusvara, Bhūtamuni, Kanakamuni, Krakucchanda, Kāśyapa, Śikhin, Viśvabhuk, Vipaśyin, and Śākyamuni. {1.39}

source: པདྨའི་གདན་དག་ལ་བཞུགས་པར་གྱུར་ཏོ། །
en: These and many other lord buddhas, having illuminated the realm of the Pure Abode, sat on their lotus seats.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱང་དེ་ལྟ་བུའི་ཚུལ་དུ་ལྷགས་པར་གྱུར་ཏེ།
en: There was also a multitude of bodhisattvas there who arrived in a similar way. They were: {1.40}

source: འདི་ལྟ་སྟེ། ཕྱག་ན་རིན་ཆེན་དང་། ཕྱག་ན་རྡོ་རྗེ་དང་། མཉམ་པའི་ཕྱག་དང་། ནམ་མཁའི་ཕྱག་དང་། མཐའ་ཡས་ཕྱག་དང་། སའི་ཕྱག་དང་། སྣང་བའི་ཕྱག་དང་། དྲི་མེད་བཟང་པོ་དང་། བཟང་བརྩེགས་དང་། རབ་མང་བརྩེགས་དང་། ནོར་བུ་བརྩེགས་དང་། རིན་ཆེན་བརྩེགས་དང་། རིན་ཆེན་ཕྱག་དང་། ཀུན་ནས་ཕྱག་དང་། དྲི་ལྡན་ཕྱག་དང་། ལེགས་འགྲོ་དང་། དྲི་མེད་འགྲོས་དང་། འཇིག་རྟེན་འགྲོས་དང་། མཛེས་པའི་འགྲོས་དང་། མཐའ་ཡས་འགྲོས་དང་། གྲགས་པ་མཐའ་ཡས་དང་། གྲགས་པ་བཟང་པོ་དང་། གྲགས་པའི་དྲི་མ་བྲལ་དང་། གྲགས་པའི་འགྲོ་བ་དང་། གྲགས་པ་དྲི་མ་མེད་པ་དང་། གྲགས་པ་དང་། གྲགས་པ་འདྲེན་པ་དང་། མགོན་པོ་དང་། མགོན་པོར་གྱུར་པ་དང་། ཀུན་ནས་མགོན་པོ་དང་། རྒྱུན་ཤེས་ཀྱི་བུ་དང་། མཐའ་ཡས་རྒྱུན་ཤེས་ཀྱི་བུ་དང་། ཀུན་ནས་རྒྱུན་ཤེས་ཀྱི་བུ་དང་། བྱམས་པའི་བུ་དང་། བྱམས་པ་བཟང་པོའི་བུ་དང་། བྱམས་པའི་བུ་མ་ཡིན་པ་དང་། དུས་གསུམ་རྒྱུན་ཤེས་ཀྱི་བུ་དང་། རྒྱུན་ཤེས་ཀྱི་བུ་འབྲས་བུ་དང་བཅས་པ་དང་། རྒྱུན་ཤེས་ཀྱི་བུ་དཀོན་མཆོག་གསུམ་དང་། རྒྱུན་ཤེས་ཀྱི་བུ་སྐྱབས་གསུམ་དང་། རྒྱུན་ཤེས་ཀྱི་བུ་ཐེག་པ་གསུམ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་ལྡན་པ་དང་། ཡིད་འོང་བཟང་པོ་དང་། གསུང་སྙན་ལྡན་དང་། ཆོས་ཀྱི་དབང་ཕྱུག་དང་། དངོས་མེད་དབང་ཕྱུག་དང་། འཇིག་རྟེན་དབང་ཕྱུག་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། ལེགས་གཟིགས་དབང་ཕྱུག་དང་། རྣམ་གཟིགས་དབང་ཕྱུག་དང་། འཇིག་རྟེན་མཆོད་འོས་དང་། ལེགས་མཆོད་དང་། སྒྲ་སྒྲོགས་དབང་ཕྱུག་དང་། རྔ་ཆེན་དབང་ཕྱུག་དང་། སྣ་ཚོགས་སྒྲའི་དབང་ཕྱུག་དང་། རྣམ་འཇིག་དབང་ཕྱུག་དང་། མཐོན་ཀ་བཟང་པོ་དང་། སྐུ་མཛེས་དང་། གྲགས་ལྡན་དང་། ཉི་མའི་འོད་དང་། ཁྱབ་འཇུག་བདག་པོ་དང་། བདག་པོའི་ངང་ཚུལ་དང་། ནམ་མཁའ་དང་། ནམ་མཁའི་སྙིང་པོ་དང་། དོན་ཐམས་ཅད་ཀྱི་སྙིང་པོ་དང་། ཐམས་ཅད་འབྱུང་བ་དང་། ངན་སོང་སྤོང་བ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་། ཆོས་མ་ཡིན་པ་གཅོད་པར་བྱེད་པ་དང་། དེ་དག་དང་། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་ལྷན་ཅིག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ན་བཞུགས་སོ། །
en: Ratnapāṇi, Vajrapāṇi, Supāṇi, Gagaṇapāṇi, Anantapāṇi, Kṣitipāṇi, Ālokapāṇi, Sunirmala , Sukūpa, Prabhūtakūṭa, Maṇikūṭa, Ratnakūṭa, Ratnahastin, Samantahastin, Gandhahastin, Sugati, Vimalagati, Lokagati, Cārugati, Anantagati, Anantakīrti, Sukīrti, Vimalakīrti, Gatikīrti, Amalakīrti, Kīrtikīrti, Nātha, Anātha, Nāthabhūta, Lokanātha, Samantanātha, Ātreya, Anantatreya, Samantatreya, Maitreya , Sunetreya, Namantreya, Tṛdhatreya, Saphalātreya, Triratnātreya, Triśaraṇātreya, Triyāṇātreya, Visphūrja, Sumanojña, Valgusvara, Dharmeśvara, Abhāveśvara, Samanteśvara, Lokeśvara, Avalokiteśvara, Sulokeśvara, Vilokiteśvara, Lokamaha, Sumaha, Garjiteśvara, Dundubhīśvara, Vitateśvara, Vidhvasteśvara, Suvakṣa, Sumūrti, Sumahat, Yaśovat, Ādityaprabhāva, Prabhaviṣṇu, Someśvara, Soma, Saumya, Anantaśrī, Lokaśrī, Gagana, Gaganāḍhya, Gaganagañja, Kṣiteśvara, Maheśvara, Kṣiti, Kṣitigarbha, Nīvaraṇa, Sarvāvaraṇa, Sarvāvaraṇa­viṣkambhin, Sarva­nīvaraṇa­viṣkambhin, Samanta­nirmathana, Samantabhadra, Bhadrapāṇi, Sudhana, Susaṃhata, Supuṣya, Sunala, Ākāśa, Ākāśagarbha, Sarvārtha­garbha, Sarvodbhava, Anivartin, Anivartita, Apāyajaha, Avivartita, Avaivarttika, and Sarva­dharmopaccheda. {1.41} Lord Śākyamuni dwelt with these and other bodhisattvas in the realm of the Pure Abode.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བུད་མེད་ཀྱི་གཟུགས་འཆང་བ་རྣམས་ཏེ། སྤྱོད་པ་མཐའ་ཡས་པའི་དོན། འཇིག་རྟེན་སྒྲུབ་པའི་དོན།
en: There were also other bodhisattva great beings. Some, with female forms, fulfill the purpose of bodhisattva conduct throughout the infinite universe.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཕྱིར་མི་ལྡོག་པའི་ལམ་ལ་དགོད་པས་བསམ་གྱིས་མི་ཁྱབ་པའི་རིག་པའི་ཚིག་དང་། སྔགས་ཀྱི་ཚིག་དང་།
en: Some embody the inconceivable magical formulae of mantras and dhāraṇīs with the power to establish the minds of all beings on the path of no return.

source: གཟུངས་དང་། སྨན་གྱི་ཆ་བྱད་འཛིན་པ་དང་།
en: Some take on the forms of medicinal herbs.

source: འདབ་ཆགས་ཀྱི་ཚོགས་རྣམ་པ་སྣ་ཚོགས་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ནོར་བུ་དང་། སྔགས་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་གྲངས་སུ་རྗེས་སུ་ཡང་དག་པར་འཇུག་པའི་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་པ་དང་།
en: Some emulate the ways of different types of beings, entering flocks of birds, yakṣa s, rākṣasas, or entities not designated as sentient beings ( asattva­saṁkhyāta ), such as jewels, mantras, or wish-fulfilling kings of gems.

source: སེམས་ཅན་གྱི་བསམ་པ་ཅི་ལྟར་འདུལ་བར་བྱེད་པ་དེ་བཞིན་དུ་བྱེད་པ་རྣམས་དང་། དེ་དང་རྗེས་སུ་མཐུན་པའི་མིང་དང་འབྲེལ་བ་རྣམས་དང་།
en: They act in a manner suitable for taming beings according to their individual capacities and take on the forms most suited to this purpose.

source: རིག་པའི་རྒྱལ་པོའི་ཉེ་བར་བསྟན་པ་དང་། ཆོས་ཅི་ལྟ་བ་བཞིན་དུ་རྟོག་པ་ལས་ངེས་པར་འབྱུང་བ་དང་།
en: The Lord dwelt there with uṣṇīṣa kings who grant proficiency in the Dharma based on perfect realization in accordance with the instructions pertaining to vidyārāja.

source: དེ་བཞིན་གཤེགས་པ་དང་། པདྨ་དང་། རྡོ་རྗེའི་རིགས་དང་། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་རིགས་ཀྱི་རྗེས་སུ་ཞུགས་པ།
en: They cause beings to enter the Tathāgata, Lotus , and Vajra families and all the worldly and supramundane families.
